import traceback
from typing import Any


def logg_error_data(exc: Exception) -> dict[str, Any]:
    """Форматирует данные об ошибке в виде словаря для логирования.

    Эта функция принимает сообщение об ошибке и исключение, а затем
    создает словарь, содержащий информацию о типе ошибки, её описании,
    аргументах и трассировке стека.

    :param message: Сообщение, описывающее контекст ошибки.
    :param exc: Исключение, которое было вызвано, и о котором нужно собрать информацию.
    :return: Словарь, содержащий информацию об ошибке, включая:
        - "message": сообщение об ошибке.
        - "error": словарь с деталями об ошибке, включая:
            - "type": тип исключения (имя класса).
            - "description": строковое представление исключения.
            - "args": аргументы, переданные исключению.
            - "traceback": строка с трассировкой стека ошибки.
    """
    error_stack: str = traceback.format_exc()
    return {
        "type": type(exc).__name__,
        "description": str(exc),
        "traceback": error_stack,
    }
