from pydantic import BaseModel, ConfigDict


class ABCSchema(BaseModel):
    """Модель Pydantic для валидации данных пользователя.

    Этот класс используется для представления и валидации данных.
    Он позволяет создавать экземпляры модели из объектов с
    атрибутами, а также обеспечивает валидацию входных данных.

    Конфигурация модели:
    ---------------------
    - `from_attributes`: Позволяет создавать экземпляры модели из
        объектов с атрибутами.
    - `populate_by_name`: Позволяет заполнять поля модели по
        имени, даже если они не совпадают с именами атрибутов.
    - `use_enum_values`: Использует значения перечислений вместо
        самих перечислений при сериализации и десериализации.
    - `arbitrary_types_allowed`: Разрешает использование произвольных
        типов в качестве полей модели.
    """

    model_config = ConfigDict(
        from_attributes=True,
        populate_by_name=True,
        use_enum_values=True,
        arbitrary_types_allowed=True,
    )
